[
    {
        "title": "Codebot",
        "description" : "A fine-tuned Chatbot that helps you with coding, by providing code snippets and explanations.",
        "www":{
            "what":"A fine-tuned Chatbot that helps you with coding, by providing code snippets and explanations.",
            "why":"I wanted to create a chatbot that can help people with coding, and I was fascinated by the capabilities of AI & LLMs.",
            "who":"Anyone who needs help with coding."
        },
        "what_i_learnt": [
            "This was my first project working with LLMs. As all beginners, it was a very exciting (but also frustrating) journey.",
            "Following the popularity of ChatGPT, I was really fasincated by the capabilities of AI & LLMs. I wanted to create my own chatbot that can help people with coding.",
            "This was the point where I first discovered open-source LLMs, and I was really excited to try them out. I used the GPT-2 model, and I was amazed by how well it could generate code snippets- though of course GPT-3 was wayyyyy better.",
            "I also learned how to use the Hugging Face Transformers library, and how to fine-tune the model on my own dataset. I created a dataset of code snippets and explanations, and I fine-tuned the model on it.",
            "(In hindsight, and knowing what I know now, wow- I learnt so much since then!)"
        ],
        "impact" :["Reduced the time taken to search for code snippets and explanations online, by providing a chatbot that can generate them on-the-fly.",
        "Helped people learn coding by providing explanations and code snippets in a conversational manner."],
        "image": "/frontend/src/assets/project_images/llm_icon.jpg",
        "url": "https://github.com/izack8/codebot",
        "year": 2024,
        "technologies": [{
            "name": "Python",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/python/python-original.svg"
        }, {
            "name": "Hugging Face",
            "icon": "/icons/hf-logo.svg"
        }, {
            "name": "Torch",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/pytorch/pytorch-original.svg"
        },
        {
            "name": "Streamlit",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/streamlit/streamlit-original.svg"
        }]
    },
    {
        "title": "Nanyang Marche",
        "description" : "An app designed to help NTU students connect with each other, through online forums, and a marketplace for students to buy and sell items.",
        "www":{
            "what":"An app designed to help NTU students connect with each other, through online forums, and a marketplace for students to buy and sell items.",
            "why":"I wanted to create an app that can help NTU students connect with each other, and I was fascinated by the capabilities of Flutter.",
            "who":"NTU students."
        },
        "what_i_learnt": [
            "One problem I observed in NTU's hall culture, is that students usually have a lot of furniture and items that they no longer need, but they don't know how to get rid of them. So they just throw them away, which is a waste of resources. hence, I wanted to create a marketplace for students to buy and sell, and also hopefully cultivating a new culture.",
            "I orginally wanted to create a website, but I realized that it would be better to create an app, because students are more likely to use an app than a website. So I decided to create a mobile app using Flutter."
        ],
        "impact" :["Helped NTU students connect with each other, through online forums and a marketplace for students to buy and sell items.",
        "Cultivated a new culture of buying and selling items among NTU students, reducing waste and promoting sustainability."],
        
        "image": "/frontend/src/assets/project_images/nanyang_marche.png",
        "url": "https://github.com/izack8/nanyang_marche/blob/master/Nanyang_Marche_Report.pdf",
        "year": 2023,
        "technologies": [{
            "name": "Flutter",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/flutter/flutter-original.svg"
        }, {
            "name": "Dart",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/dart/dart-original.svg"
        }, {
            "name": "Firebase",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/firebase/firebase-plain.svg"
        }]
    },
    {
        "title": "Personal Website Building",
        "description" : "Building my own website, using HTML, CSS, JS, Python, and FastAPI (and gradually more frameworks as I learn more).",
        "www":{
            "what":"Building my own website, using HTML, CSS, JS, Python, and FastAPI (and gradually more frameworks as I learn more).",
            "why":"I wanted to learn and experience the process of building a website from scratch, without using online Web Building tools etc.",
            "who":"Anyone who wants to learn how to build a website from scratch."
        },
        "what_i_learnt": [
            "I wanted to learn and experience the process of building a website from scratch, without using online Web Building tools etc. I feel like this process helps me understand why certain things are done in a certain way, which I feel is the best way to learn anything.",
            "Like for example I was having such a hard time coding up the JS function for the looping and dynamic updating of details and html, but then I discovered HTML templating (like Jinja2 for Python, and Thymeleaf for Java), and it's like- oh, that's why people use it!",
            "And on-top of this, I also learned the smaller things where people usually miss, like how important the file structure in the project folder and in JSON files etc. Like I need to write and organize them to meet my needs, and not just copy-paste from the internet.",
            "ARGH! So many things to learn! So exciting!",
            "OK I'm getting carried away.",
            "And oh yeah, how to deploy on cloud etc. I'm using Azure now, cause the subscription is free for students, and I learned how to by watching a YouTube video."
        ],
        "impact" :["Helped me learn and experience the process of building a website from scratch, without using online Web Building tools etc.",
        "Helped me understand why certain things are done in a certain way, which I feel is the best way to learn anything.",
        "Helped me learn how to deploy on cloud etc."],
        "image": "/frontend/src/assets/project_images/my_website.jpg",
        "url": "",
        "year": 2025,
        "technologies": [{
            "name": "HTML",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/html5/html5-original.svg"
        }, {
            "name": "CSS",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/css3/css3-original.svg"
        }, {
            "name": "JavaScript",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/javascript/javascript-original.svg"
        }, {
            "name": "Python",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/python/python-original.svg"
        }, {
            "name": "FastAPI",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/fastapi/fastapi-original.svg"
        }]
    },
    {
        "title": "STARs Automation for module selection",
        "description": "Automating the module selection process for NTU students (just myself, ngl).",
        "www": {
            "what": "Automating the module selection process for NTU students (just myself, ngl).",
            "why": "I wanted to automate the module selection process for NTU students, because the system is so painful to use.",
            "who": "NTU students."
        },
        "what_i_learnt": [
            "OK so if you're from NTU, then you know how HORRIBLE the STARs system is. Context for non-NTU students, we have a frigging painful system for customizing our time-tables + modules selection every semester. It's basically fastest fingers first, BUT the system crashes every time, or your internet lags behind or something. It's a MESS.",
            "So once you get into the system, you have to get to the module selection page, and then you have to click module, and then you have to click through like 5654984 more buttons to confirm the selection. And then you have to do this for every module you want to select.",
            "Anyways, I got fed up with the tireless clicking (cause it's literally the same buttons you have to click every time), so I decided to automate it, and let it run in the background while I do OTHER IMPORTANT THINGS.",
            "It was on my Mac, so I used AppleScript to automate some keyboard presses (like \"Tab\" and \"Enter\"), on my MacBook Air M2. (so hmu if you need the simple script)"
        ],
        "impact": ["Reduced the time taken to select modules, by automating the process.",
        "Helped NTU students select their modules faster and more efficiently."],
        "image": "/frontend/src/assets/project_images/apple_script.png",
        "url": "",
        "year": 2023,
        "technologies": [{
            "name": "AppleScript",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/applescript/applescript-original.svg"
        }, {
            "name": "MacOS",
            "icon": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/apple/apple-original.svg"
        }]
    }
]